<template>
  <div class="mx-auto max-w-screen-2xl px-8 py-20 flex flex-col gap-20">
    <div class="flex flex-col gap-6 max-w-3xl">
      <div class="text-3xl text-red-600 uppercase font-bold">
        Влияние городской инфраструктуры на здоровье
      </div>
      <div>
        Разработанный продукт (цифровой инструмент) позволит формировать
        региональные и муниципальные программы укрепления общественного
        здоровья, включая анализ доступности алкоголя, табака, продуктов питания
        и возможностей для физической активности. В основе инструмента будут
        заложены не только возможности для анализа, но и алгоритмы рекомендаций
        по формированию среды. Разработанный продукт (цифровой инструмент)
        позволит планировать конкретные действия, направленные на изменение
        инфраструктуры муниципалитета/региона в целом, способствующие созданию
        здоровьесберегающей среды.
      </div>
    </div>
    <div class="flex flex-col gap-6">
      <div class="flex gap-6 flex-col lg:flex-row">
        <Card
          title="Населенный пункт"
          description="Возможность выбора населенного пункта на карте"
          img="/city.jpg"
          class="lg:w-4/6"
        />
        <Card
          title="Анализ данных"
          description="Учет множества факторов"
          img="/analysis.jpg"
          class="lg:w-2/6"
        />
      </div>
      <div class="flex gap-6 flex-col lg:flex-row">
        <Card
          title="Рекомендации"
          description="Поиск эффективных решений"
          img="/park.jpg"
          class="lg:w-2/6"
        />
        <Card
          title="Здоровье"
          description="Повышение уровня здоровья населения за счет качественного анализа"
          img="/child.jpg"
          class="lg:w-4/6"
        />
      </div>
    </div>
    <div class="flex flex-col gap-20">
      <Content
        title="Изучите влияние факторов городской среды"
        description="Мы анализируем, как факторы городской среды влияют на здоровье населения, пссихологическую обстановку, уровень жизни"
        img="/sport.jpg"
        textAlign="right"
      />
      <Content
        title="Населенный пункт"
        description="Возможность выбора населенного пункта на карте"
        img="/night.jpg"
        textAlign="left"
      />
    </div>
    <div class="flex flex-col gap-12 pt-20 w-full">
      <div class="text-3xl text-red-600 uppercase font-bold">
        Влияние городской инфраструктуры на здоровье
      </div>
      <div class="flex flex-col md:flex-row gap-20 font-light justify-between">
        <div class="md:w-1/3">
          <div class="text-red-600 mb-2">Как мы анализируем?</div>
          <div>Мы анализируем, как факторы городской среды влияют на здоровье населения, пссихологическую обстановку, уровень жизни. Повышение уровня здоровья населения за счет качественного анализа</div>
        </div>
        <div class="md:w-1/3">
          <div class="text-red-600 mb-2">Как мы анализируем?</div>
          <div>Мы анализируем, как факторы городской среды влияют на здоровье населения, пссихологическую обстановку, уровень жизни. Повышение уровня здоровья населения за счет качественного анализа</div>
        </div>
        <div class="md:w-1/3">
          <div class="text-red-600 mb-2">Как мы анализируем?</div>
          <div>Мы анализируем, как факторы городской среды влияют на здоровье населения, пссихологическую обстановку, уровень жизни. Повышение уровня здоровья населения за счет качественного анализа</div>
        </div>
      </div>
    </div>
    <div class="flex flex-col gap-12 pt-20 w-full">
      <div class="text-3xl text-red-600 uppercase font-bold">
        О нас
      </div>
      <div class="flex flex-col md:flex-row gap-20 font-light justify-between">
        <div class="md:w-1/3">
          <div class="text-red-600 mb-2">Как мы анализируем?</div>
          <div>Мы анализируем, как факторы городской среды влияют на здоровье населения, пссихологическую обстановку, уровень жизни. Повышение уровня здоровья населения за счет качественного анализа</div>
        </div>
        <div class="md:w-1/3">
          <div class="text-red-600 mb-2">Как мы анализируем?</div>
          <div>Мы анализируем, как факторы городской среды влияют на здоровье населения, пссихологическую обстановку, уровень жизни. Повышение уровня здоровья населения за счет качественного анализа</div>
        </div>
        <div class="md:w-1/3">
          <div class="text-red-600 mb-2">Как мы анализируем?</div>
          <div>Мы анализируем, как факторы городской среды влияют на здоровье населения, пссихологическую обстановку, уровень жизни. Повышение уровня здоровья населения за счет качественного анализа</div>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import Card from "../components/home/Card.vue";
import Content from "../components/home/Content.vue";
</script>
